app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators"
---
  def index
    @administrators = Administrator.all

INSERT INTO "administrators" ("name", "login", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @administrator = Administrator.new(administrator_params)
    if @administrator.save

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    @administrator = Administrator.find(params[:id])