app/controllers/sessions_controller.rb

  def create
    @administrator = Administrator.find_by_login(params[:session][:login])
---
SELECT  "administrators".* FROM "administrators" WHERE "administrators"."login" = ? LIMIT 1  [["login", "login"]]